package com.human.ex;

import java.util.Scanner;

public class 배열3 {

	public static void main(String[] args) {
	
		
		//1)배열a에1,2,3을 넣은 후 배열 내의 모든 값에 2를 더한값인 3,4,5로 변경후 화면에 출력
	    int a[]= {1,2,3};
		for(int i=0;i<3;i++) {
		a[i]=a[i]+2;
		}


		for(int i=0;i<3;i++) {
	    System.out.println(a[i]);
		}
		
		//--------------------------------------------------------------------------------------------------------------
	/*2)배열a[10]에 3의 배수를 넣은다음에 배열의 내용을 순서대로 출력 
	int a[]=new int[10];
		for(int i=0;i<10;i++) {
		a[i]=(i+1)*3;
		}
		for(int i=0;i<10;i++){
	System.out.println(a[i]);


		}*/
		----------------------------------------------------------------------------------------------------------------
	/*3)배열a[100]에 1부터 100까지의 숫자를 순서대로 넣은 후 배열의 인덱스가 짝수인 값만 출력 
	int a[]=new int[100];
		int i=0;
		while(i<100){
		a[i]=i+1;
		i++;
		}
		i=0;
		while(i<100) {
		if(a[i]%2==0) {
	System.out.println(a[i]);
		}else{
		}
		i++;

		}*/
	----------------------------------------------------------------------------------------------------------------------
	/*4)배열int a[]= {12,1,5,3,6,8,5,3}를 만든 다음 배열의 모든 내용을 더한값을 sum에 저장하여 출력

	int a[]= {12,1,5,3,6,8,5,3};
	 int i=0;
	 int sum=0;
	 while(i<8) {
	 sum=sum+a[i];
	 i++;

	 }
	System.out.println(sum);*/
	--------------------------------------------------------------------------------------------------------------- 
	/*5) int a[]= {12,1,5,3,6,8,5,3}의 a배열에서 배열안의 숫자가 짝수인 값을 더한 결과값 출력

	int a[]= {12,1,5,3,6,8,5,3};
	 int i=0;
	 int sum=0;
	 while(i<8) {
	 if(a[i]%2==0) {
	 sum=sum+a[i];
	 }else {

	 }
	 i++;

	 }
	System.out.println(sum);
*/
	/*------------------------------------------------------------------------
		6) int a[]= {12,1,51,3,6,8,5}a의 배열에서 가장 큰값과 작은값을 더한 결과값 출력

	int a[]= {12,1,51,3,6,8,5};
		int max=a[0];
		int min=a[0];
		int i=0;
		while(i<7) {

		if(a[i]>max) {
		max=a[i];
		}else{
		}
		if(a[i]<min) {
		min=a[i];
		}else {
		}
		i++;
		}
		int sum=max+min;
	System.out.println(sum);



		}*/
		
	
		 

		 }

	}


